Revit 2024 API
KeyBasedTreeEntries Members
The KeyBasedTreeEntries type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the KeyBasedTreeEntries
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
FindEntry
 Finds the KeyBasedTreeEntry associated with the given key value.
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetEnumerator
Returns an enumerator that iterates through a collection.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetKeyBasedTreeEntriesIterator
 Returns a KeyBasedTreeEntriesIterator that iterates through the collection.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
KeyBasedTreeEntries Class
Autodesk.Revit.DB Namespace